[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:57:64
                             id="itemId"
                             type="text"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("itemId", { required: "itemId is required." })}
+                            {...register("itemId", { required: "" })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /itemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:69:38
                     <Form.Group className="mb-3" >
                     <Form.Label htmlFor="reviewerEmail">Reviewer Email</Form.Label>
                     <Form.Control
-                        data-testid={"MenuItemReviewForm-reviewerEmail"}
+                        data-testid={""}
                         id="reviewerEmail"
                         type="text"
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewForm-reviewerEmail"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:111:26
                         {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                     />
                     <Form.Control.Feedback type="invalid">
-                        {errors.dateReviewed && 'dateReviewed is required in iso format.'}
+                        {true}
                     </Form.Control.Feedback>
                 </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /dateReviewed is required in iso format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
