[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:225:55
                         id="reviewerEmail"
                         type="text"
                         isInvalid={Boolean(errors.name)}
-                        {...register("reviewerEmail", {
-                            required: "reviewerEmail is required."
-                        })}
+                        {...register("reviewerEmail", {})}
                     />
                     <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /reviewerEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:244:59
                         id="stars"
                         type="text"
                         isInvalid={Boolean(errors.itemId)}
-                        {...register("stars", { required: "Stars is required" })}
+                        {...register("stars", { required: "" })}
                     />
                     <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
