[Killed] Regex
main/components/Articles/ArticlesForm.js:19:23
 
     const navigate = useNavigate();
 
-    const dateRegex = /(19|2[0-9])\d{2}-\d{2}-\d/;
+    const dateRegex = /(19|2[0-9])\D{2}-\d{2}-\d/;
 
     return (
killedBy: ArticlesForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] Regex
main/components/Articles/ArticlesForm.js:19:23
 
     const navigate = useNavigate();
 
-    const dateRegex = /(19|2[0-9])\d{2}-\d{2}-\d/;
+    const dateRegex = /(19|2[0-9])\d-\d{2}-\d/;
 
     return (
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: TypeError: e is not a function

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:50:63
                             id="email"
                             type="email"
                             isInvalid={Boolean(errors.email)}
-                            {...register("email", { required: 'Email is required.'})}
+                            {...register("email", { required: ""})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:50:42
                             id="email"
                             type="email"
                             isInvalid={Boolean(errors.email)}
-                            {...register("email", { required: 'Email is required.'})}
+                            {...register("", { required: 'Email is required.'})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BlockStatement
main/components/Articles/ArticlesForm.js:68:54
                             isInvalid={Boolean(errors.dateAdded)}
                             {...register("dateAdded", { 
                                 required: 'A real date is required.',     
-                                validate: (value) => {
-                                return dateRegex.test(value) || "Date Added must be a real date with a year from 1900-2999.";
-                              },
+                                validate: (value) => {},
                             })}
                         />
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: TypeError: e is not a function

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:69:40
                             {...register("dateAdded", { 
                                 required: 'A real date is required.',     
                                 validate: (value) => {
-                                return dateRegex.test(value) || "Date Added must be a real date with a year from 1900-2999.";
+                                return true;
                               },
                             })}
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: TypeError: e is not a function

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:69:40
                             {...register("dateAdded", { 
                                 required: 'A real date is required.',     
                                 validate: (value) => {
-                                return dateRegex.test(value) || "Date Added must be a real date with a year from 1900-2999.";
+                                return dateRegex.test(value) && "Date Added must be a real date with a year from 1900-2999.";
                               },
                             })}
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Date Added must be a real date with a year from 1900-2999/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:90:43
                             type="text"
                             isInvalid={Boolean(errors.title)}
                             {...register("title", {
-                                required: "Title is required."
+                                required: ""
                             })}
                         />
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Title is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
